{
    "perf_verif": {
	"title": "Performance Verification and Synthesis",
	"description": "<p>We are developing a set of methods to design networked systems that perform reliably. Today, we build systems with hundreds of heuristic control algorithms whose emergent behaviors we do not fully understand. These algorithms provision compute resources, choose network routes, allocate bandwidth and storage resources, schedule tasks etc. These tasks are central to the performance and reliability of networked systems, making it crucial for the algorithms to make correct decisions. Designing such algorithms is hard because they operate in the face of incomplete information, uncertainty about the future and constraints on decision-making latency. Thus, a lot of effort goes into their design, based largely on empirical trial-and-error. Today, we lack principled ways to reason about their performance. In this project, we are developing a set of techniques to address this gap, often using program verification and synthesis techniques to augment human intelligence.</p><p>There is now a vibrant community of researchers working on the topic, including people from CMU, U. Michigan, Georgia Tech, MIT, Microsoft Research, and U. Waterloo</p>"
    },
    "cc": {
	"title": "\"Solving\" Congestion Control",
	"description": "<p>We have embarked on a (potentially foolish) journey to \"solve\" end-to-end congestion control for the internet. To this end, we first came up with a mathematical definition of what it means to solve it [{{icite.ccac}}]. Existing definitions assume far too much about how the network behaves. Thus, we came up with a method to specify network models that make minimal assumptions and are nevertheless sufficient for congestion control algorithms (CCAs) to work (we later realized this technique was general, which lead to our work on performance verification).</p> <p> The next challenge is to find a CCA that achieves a set of performance properties under this network model. This is ongoing work, where we heavily use automated reasoning to discover algorithms and prove impossibility results [{{icite.starvation}}, {{icite.ccmatic_hotnets}}, {{icite.ccmatic}}]. We now have CCAs that satisfy a subset of the properties we want. Read more to see all the properties that we are trying to achieve and their current status.</p> <p>Meta is currently using some of our designs to serve their user traffic [{{icite.copafb}}, {{icite.ccac}}]</p>"
    },
    "rfocus": {
	"title": "Metasurfaces with Thousands of Antennas",
	"description": "<p>Fundamental diffraction limits tell us that the more antennas a radio device has, the more precisely it can control the signals. This project explores the new applications enabled by having thousands of radio-frequency antennas, made inexpensive through meta-surfaces. As a first step toward this, we built a system with 3200 antennas that can increase the signal strength between two radio endpoints by about 10&times; [{{icite.rfocus}}]. It works by automatically reconfiguring itself to passively reflect signals from the transmitter to the receiver. The very large number of antennas allows it to create extremely focussed beams that can increase point-to-point communication bandwidth and reduce interference between multiple pairs of communicating endpoints.</p><p>To our knowledge, this is the largest number of antennas ever used for a single communication link.</p>"
    }
}
